Repository: karina-klinkeviciute/rainbow-challenge-front
Catalog: lib/localization/app_*.arb
Languages: lt, sk

# enter_email
source: Enter your email
lt: Įvesk el. pašto adresą
sk: Zadajte e-mailovú adresu

# email_enter_valid
source: Please enter a valid email.
lt: Prašom įvesti tinkamą el. pašto adresą
sk: Prosím, zadajte platnú e-mailovú adresu

source: Password
lt: Slaptažodis
sk: Heslo

source: New user
lt: Naujas naudotojas
sk: Nový používateľ

source: Change password
lt: Keisti slaptažodį
sk: Zmeniť heslo

# password_hint
source: Password
lt: Slaptažodis
sk: Heslo

source: Repeat password
lt: Pakartokite slaptažodį
sk: Zopakujte heslo

source: Current Password
lt: Dabartinis slaptažodis
sk: Aktuálne heslo

source: Passwords must match
lt: Slaptažodžiai turi sutapti
sk: Heslá musia byť rovnaké

# password_rules
source: Password has to be not shorter than 8 symbols, and has to contain at least 1 number.
lt: Slaptažodis turi būti ne trumpesnis negu 8 simboliai, iš jų bent 1 skaičius
sk: Heslo musí mať aspoň 8 znakov, z toho aspoň 1 číslo

# password_update_success
source: Password changed successfully
lt: Slaptažodis pakeistas sėkmingai
sk: Heslo bolo úspešne zmenené

# password_recovery_url
source: Password recovery link sent to the specified email
lt: Slaptažodžio atstatymo nuoroda nusiųsta nurodytu el. pašto adresu
sk: Odkaz na obnovenie hesla bol odoslaný na zadanú e-mailovú adresu

# registration_successful
source: Registration successful. You will be able to login after account activation. We've sent the activation link to your email.
lt: Registracija sėkminga. Prisijungti galėsi po to, kai aktyvuosi paskyrą. Aktyvavimo nuorodą nusiuntėme nurodytu el. pašto adresu.
sk: Registrácia bola úspešná. Prihlásiť sa budete môcť po aktivácii účtu. Odkaz na aktiváciu sme poslali na zadanú e-mailovú adresu.

source: User Settings
lt: Naudotojo nustatymai
sk: Nastavenia používateľa

# settings_changed
source: Settings have been changed
lt: Nustatymai pakeisti
sk: Nastavenia boli zmenené

# action_back_to_profile
source: Back to profile
lt: Atgal į profilį
sk: Späť na profil

# action_back_to_challenges
source: Back to challenges
lt: Atgal į užduotis
sk: Späť k úlohám

# action_login
source: Login
lt: Prisijungti
sk: Prihlásiť sa

# action_logout
source: Logout
lt: Atsijungti
sk: Odhlásiť sa

# action_submit
source: Submit
lt: Pateikti
sk: Odoslať

# action_register
source: No account yet? Register!
lt: Neturi paskyros? Registruokis
sk: Nemáte účet? Zaregistrujte sa

# action_have_account_login
source: Already have an account? Login
lt: Turi paskyrą? Prisijunk
sk: Máte účet? Prihláste sa

# action_forgot_password
source: Forgot password? Click here
lt: Užmiršai slaptažodį? Spausk čia
sk: Zabudli ste heslo? Kliknite sem

# action_update_settings
source: Update settings
lt: Atnaujinti nustatymus
sk: Aktualizovať nastavenia

# action_back
source: Go back
lt: Grįžti
sk: Vrátiť sa

# menu_home
source: Home
lt: Pradžia
sk: Domov

# menu_profile
source: Profile
lt: Profilis
sk: Profil

# menu_challenges
source: Challenges
lt: Užduotys
sk: Úlohy

# menu_regions
source: Regions
lt: Regionai
sk: Regióny

# menu_navigation
source: Navigation
lt: Navigacija
sk: Navigácia

# menu_challenges_joined
source: Joined challenges
lt: Pradėtos užduotys
sk: Začaté úlohy

# menu_about
source: About
lt: Apie
sk: O nás

# menu_qr_code
source: Scan QR code
lt: QR kodas
sk: QR kód

# menu_shop
source: Shop
lt: Parduotuvė
sk: Obchod

# menu_messages
source: Messages
lt: Žinutės
sk: Správy

source: Rules
lt: Taisyklės
sk: Pravidlá

source: Conditions
lt: Sąlygos
sk: Podmienky

# home_empty_title
source: Content is being prepared, but you can start with challenges!
lt: Šiuo metu turinys ruošiamas, tačiau jau dabar gali pradėti spręsti užduotis!
sk: Obsah sa momentálne pripravuje, ale už teraz môžete začať riešiť úlohy!

source: Gender
lt: Lytis
sk: Pohlavie

# gender_if_other
source: Lytis, jei kita
sk: Pohlavie, ak iné

source: Region
lt: Regionas
sk: Región

# gender_woman
source: Woman
lt: Moteris
sk: Žena

# gender_man
source: Man
lt: Vyras
sk: Muž

# gender_non_binary
source: Non-binary
lt: Nebinarinė
sk: Nebinárne

# gender_other
source: Other
lt: Kita
sk: Iné

# gender_prefer_not_to_say
source: Prefer not to say
lt: Nenoriu nurodyti
sk: Nechcem uviesť

# year_of_birth
source: Year o birth
lt: Gimimo metai
sk: Rok narodenia

# challenge_type_article
source: Articles
lt: Straipsniai ir medija
sk: Články a médiá

# challenge_type_custom
source: Custom
lt: Įvairūs
sk: Rôzne

# challenge_type_event
source: Event participation
lt: Dalyvavimas renginiuose
sk: Účasť na podujatiach

# challenge_type_event_org
source: Event organization
lt: Renginio organizavimas
sk: Organizovanie podujatia

# challenge_type_project
source: Project
lt: Projekto įgyvendinimas
sk: Realizácia projektu

# challenge_type_quiz
source: Quiz
lt: Žinių patikrinimas
sk: Test znalostí

# challenge_type_reacting
source: Reaction to events
lt: Reagavimas į įvykius
sk: Reakcia na udalosti

# challenge_type_school_gsa
source: School GSA
lt: Mokyklų GSA
sk: Školský GSA

# challenge_type_story
source: Story
lt: Pasidalink savo istorija
sk: Podeľte sa o svoj príbeh

# challenge_type_support
source: Support
lt: Parama
sk: Podpora

# challenge_type_completed
source: Completed challenges
lt: Atliktos užduotys
sk: Dokončené úlohy

# challenge_event_name_hint_text
source: Name of the event *
lt: Renginio pavadinimas *
sk: Názov podujatia *

# challenge_event_description_hint_text
source: Description of the event *
lt: Renginio aprašymas *
sk: Popis podujatia *

# challenge_event_link_hint_text
source: Link to the event *
lt: Renginio nuoroda *
sk: Odkaz na podujatie *

# challenge_event_organizing_alone
source: Organizing alone
lt: Organizuoju viena/s
sk: Organizujem samostatne

# challenge_event_touch_black_screen_for_qr
source: Touch the black screen to scan the QR code
lt: Paliesk juodą ekraną QR kodo skenavimui
sk: Dotknite sa čiernej obrazovky pre skenovanie QR kódu

# challenge_event_qr_scanned
source: QR code has been scanned
lt: QR kodas nuskenuotas
sk: QR kód bol naskenovaný

# challenge_event_qr_code_incorrect
source: QR code is incorrect
lt: QR kodas neteisingas
sk: QR kód je nesprávny

# challenge_project_name_hint_text
source: Project name *
lt: Projekto pavadinimas *
sk: Názov projektu *

# challenge_project_description_hint_text
source: Description of the project *
sk: Popis projektu *

# challenge_project_link_hint_text
source: Link to the project *
lt: Projekto nuoroda *
sk: Odkaz na projekt *

# challenge_project_completed_alone
source: Completed alone
lt: Atlikau viena/s
sk: Dokončil/a/o som samostatne

# action_join_challenge
source: Join the challenge
lt: Pradėk užduotį
sk: Začať úlohu

# joined_challenge_event_field_qr_code
source: Scan QR code
lt: Skenuoti QR kodą
sk: Naskenovať QR kód

# joined_challenge_event_field_qr_code_wrong
source: Sorry! Wrong QR code
lt: Atsiprašome, neteisingas QR kodas
sk: Prepáčte, nesprávny QR kód

# joined_challenge_event_field_qr_code_right
source: Challenge accomplished!
lt: Užduotis atlikta
sk: Úloha dokončená

# correct_answers_amount
source: Amount of correct answers
lt: Teisingai atsakei įį tiek klausimų
sk: Správne ste odpovedali na toľko otázok

# rainbows_added_amount
source: Amount of Rainbows received
lt: Tau įskaičiuota tiek vaivorykščių
sk: Bolo vám pridaných toľko dúh

source: Error
lt: Klaida
sk: Chyba

# error_unknown_error
source: Unknown error, try again
lt: Nenumatyta klaida, mėginkite dar kartą
sk: Neočakávaná chyba, skúste to znova

# message_fields_are_required
source: Fields are required
lt: Laukai privalomi
sk: Polia sú povinné

# message_field_is_required
source: Field is required
lt: Laukas privalomas
sk: Pole je povinné

# message_thank_you
source: Thank you!
sk: Ďakujeme!

# message_challenge_completed_volunteer_will_take_a_look
source: Thank you or the completion o this challenge! Our volunteer will check your answer and will issue you your rainbows. You will get a notification about this.
lt: Ačiū už atliktą užduotį! Savanoris peržiūrės jūsų atsakymą ir įskaitys vaivorykštes. Apie tai būsite informuoti pranešimų skiltyje.
sk: Ďakujeme za splnenie úlohy! Dobrovoľník skontroluje vašu odpoveď a pripočíta vám dúhy. Budete o tom informovaní v sekcii oznámení.

# message_challenge_completed_rainbows_issued
source: Thank you or the completion o this challenge! Rainbows have been issued to you.
lt: Ačiū už atliktą užduotį. Jums vaivorykštės įskaičiuotos.
sk: Ďakujeme za splnenie úlohy. Dúhy vám boli pripísané.

# message_changes_where_saved
source: Changes where saved
lt: Pakeitimai išsaugoti
sk: Zmeny boli uložené

# challenge_completed_already
source: Challenge already accomplished
lt: Šią užduotį jau atlikote
sk: Túto úlohu ste už splnili

# challenge_continue_single
source: Continue challenge
lt: Tęsti jau pradėtą užduotį
sk: Pokračovať v už začatej úlohe

# challenge_continue
source: Continue
lt: Tęsti
sk: Pokračovať

# challenge_save_and_submit_later
source: Save and submit later
lt: Saugoti ir pateikti vėliau
sk: Uložiť a odoslať neskôr

# challenge_description_hint_text
source: Describe how you completed this task *
lt: Aprašykite, kaip atlikote užduotį *
sk: Opíšte, ako ste splnili úlohu *

# challenge_link_hint_text
source: Link *
lt: Nuoroda *
sk: Odkaz *

# challenges_no_completed_challenges
source: There are no completed challenges
lt: Atliktų užduočių nėra
sk: Žiadne splnené úlohy

# challenges_no_joined_challenges
source: There are no joined challenges
lt: Pradėtų užduočių nėra
sk: Žiadne začaté úlohy

source: Challenge name
lt: Užduoties pavadinimas
sk: Názov úlohy

# article_name_hint_text
source: Article name *
lt: Straipsnio pavadinimas *
sk: Názov článku *

# article_url
source: Article link
lt: Straipsnio nuoroda
sk: URL článku

# profile_page_title
source: My profile
lt: Mano profilis
sk: Môj profil

# profile_page_stats_rainbows
source: Rainbows
lt: Vaivorykštės
sk: Dúhy

# profile_page_stats_active_weeks
source: Active weeks
lt: Aktyvios savaitės
sk: Aktívne týždne

# profile_page_medals
source: Medals
lt: Medaliai
sk: Medaily

# profile_page_achievements
source: Achievements
lt: Pasiekimai
sk: Úspechy

# action_challenge_end
source: Accomplish the challenge until
lt: Atlik šią užduotį iki
sk: Splňte túto úlohu do

source: Rainbows summary
lt: Vaivorykščių suvestinė
sk: Súhrn dúh

source: Rainbows
lt: Vaivorykštės
sk: Dúhy

source: Rainbows received
lt: Gautos Vaivorykštės
sk: Získané dúhy

# rainbows_active
source: Active Rainbows
lt: Aktyvios Vaivorykštės
sk: Aktívne dúhy

# rainbows_received_for_tasks
source: You received Rainbows or those challenges:
lt: Vaivorykštes gavai už šias užduotis:
sk: Dúhy ste získali za tieto úlohy:

# rainbows_spent_on
source: You spent Rainbows on:
lt: Vaivorykštes išleidai
sk: Dúhy ste minuli na

# shop_welcome_text
source: Exchange rainbows to nice little things!
lt: Čia galėsi keisti vaivorykštes į mielus daikčiukus
sk: Tu môžete vymeniť dúhy za roztomilé predmety

# shop_subtitle_text
source: Exchange rainbows
lt: Keisk vaivorykštes į mielus daikčiukus
sk: Vymieňajte dúhy za roztomilé predmety

source: Price
lt: Kaina
sk: Cena

source: Amount
lt: Kiekis
sk: Množstvo

source: Total
lt: Viso
sk: Celkom

source: Order
lt: Užsakyti
sk: Objednať

# order_sent
source: Order sent. we will contact you by email and will let you know hohw you can receive your prize.
lt: Užsakymas išsiųstas. Susisieksim su tavim el. paštu ir pranešim, kaip atsiimti prizus.
sk: Objednávka bola odoslaná. Kontaktujeme vás e-mailom a informujeme, ako si vyzdvihnúť odmeny.

source: Choose amount
lt: Pasirink kiekį
sk: Vyberte množstvo

# about_page_title
source: About the project
lt: Apie projektą
sk: O projekte

# about_page_logos
source: Project partners and sponsors
lt: Projekto partneriai ir rėmėjai
sk: Partneri a sponzori projektu

# messages_message
source: Message
lt: Pranešimas
sk: Správa

source: Delete account
lt: Ištrinti paskyrą
sk: Vymazať účet

# delete_account_confirm
source: Your account will be deleted in 7 days. Changed your mind? Contact info@rainbowchallenge.lt during next 3 days.
lt: Paskyra bus ištrinta per 7 dienas. Apsigalvojai? Susisiek su info@rainbowchallenge.lt per 3 dienas.
sk: Účet bude vymazaný do 7 dní. Zmenili ste názor? Kontaktujte info@rainbowchallenge.lt do 3 dní.

source: Wrong password!
lt: Neteisingas slaptažodis!
sk: Nesprávne heslo!

# user_logged_in
source: Logged in
lt: Prisijungęs
sk: Prihlásený

source: Sign in with Google
lt: Prisijungti su Google
sk: Prihlásiť sa cez Google

# social_sign_in_failed
source: Sign in with {provider} failed
lt: Prisijungimas su {provider} nepavyko
sk: Prihlásenie cez {provider} zlyhalo

source: Sign in with Apple
lt: Prisijungti su Apple
sk: Prihlásiť sa cez Apple

# files_attach_file
source: Attach file
lt: Prijungti failą
sk: Pripojiť súbor

# files_too_big
source: Error. File that you are trying to attach is too big
lt: Klaida. Failas, kurį bandote pridėti, per didelis
sk: Chyba. Súbor, ktorý sa pokúšate pridať, je príliš veľký

# label_active
source: Active
lt: Aktyvios
sk: Aktívne

source: Email
lt: El. paštas
